src/cf/maERP_ib/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/maERP_ib/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/maERP_ib/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/InformationRegisters/ПрисоединённыеФайлы/ПрисоединённыеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрисоединённыеФайлы</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Внешний</name>
    <comment>Признак хранения файла на диске</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладельцыПрисоединенныхФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Связь</name>
    <comment>Связь со внутренним реквизитом объекта</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор файла, так же служит для связи c файлом на диске</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/Catalogs/Номенклатура/Forms/FormProduitsOnStock/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ТипЦен = Справочники.ВидыЦен.Розничная;
	Если Параметры.Свойство("Контрагент") Тогда
		Если ЗначениеЗаполнено(параметры.Контрагент.ТипЦены) Тогда 
			ТипЦен = параметры.Контрагент.ТипЦены;
		КонецЕсли;
	КонецЕсли;
	LoadProducts();
	CreateButtons();
	FilterProductGroup = "__Tous1__";
	РазрешенныеПоля = СтрРазделить("Номенклатура,Артикул", ",", Ложь);
	УстановитьОграничениеДинамическогоСписка(ЭтаФорма.VT, РазрешенныеПоля);
EndProcedure

&AtServer
Procedure LoadProducts()
	If FilterProductGroup = "__Tous1__" Then 
		ProductFilter = Catalogs.Номенклатура.EmptyRef();
	Else 
		ProductFilter = Catalogs.Номенклатура.FindByCode(FilterProductGroup);
	EndIf;
	
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(StockBalance.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(PrixDeProduitSliceLast.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(PrixDeProduitSliceLast.Цена, 0) КАК ЦенаСНДС,
	|	ЕСТЬNULL(StockBalance.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.Остатки(
	|				,
	|				МестоХранения = &МестоХранения
	|					И ВЫБОР
	|						КОГДА &Produit = ЗНАЧЕНИЕ(Catalog.Номенклатура.EmptyRef)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Номенклатура В ИЕРАРХИИ (&Produit)
	|					КОНЕЦ) КАК StockBalance
	|		ПО СпрНоменклатура.Ссылка = StockBalance.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &PriceType) КАК PrixDeProduitSliceLast
	|		ПО СпрНоменклатура.Ссылка = PrixDeProduitSliceLast.Номенклатура
	|			И (PrixDeProduitSliceLast.Активность)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Produit = ЗНАЧЕНИЕ(Catalog.Номенклатура.EmptyRef)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СпрНоменклатура.Ссылка В ИЕРАРХИИ (&Produit)
	|		КОНЕЦ
	|	И НЕ СпрНоменклатура.ЭтоГруппа";
	VT.Параметры.SetParameterValue("МестоХранения",РегистрыСведений.НастройкиПользователей.СкладПользователя());
	VT.Параметры.SetParameterValue("Produit",ProductFilter);
	VT.Параметры.SetParameterValue("PriceType",ТипЦен);
	//VT.Load(Query.Execute().Unload());
	//Элементы.VT.Обновить();
EndProcedure

&AtClient
Procedure VTSelection(Item, SelectedRow, Field, StandardProcessing)
	CurData = items.VT.CurrentData;
	If CurData <> Undefined Then
		Str = New Structure("Номенклатура,Количество,Цена",CurData.Номенклатура,1,CurData.Цена);
		Close(Str);
	EndIf;
EndProcedure

&AtClient
Procedure Choisir(Command)
	CurData = items.VT.CurrentData;
	If CurData <> Undefined Then
		Str = New Structure("Номенклатура,Серия,Количество,Цена",CurData.Номенклатура,CurData.Серия,1,CurData.Цена);
		Close(Str);
	EndIf;
EndProcedure

&AtServer
Procedure CreateButtons()
	Items.FilterProductGroup.ChoiceList.Clear();
	
	Items.FilterProductGroup.ChoiceList.Add("__Tous1__", "Tous");
	
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпрНоменклатура.Ссылка КАК Produit
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	СпрНоменклатура.Ссылка
	|ИТОГИ ПО
	|	Produit ТОЛЬКО ИЕРАРХИЯ";
	
	Result = Query.Execute().Select(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	
	While Result.Next() Do
		Items.FilterProductGroup.ChoiceList.Add(Result.Produit.Code, Result.Produit);  
	КонецЦикла;	
EndProcedure

&AtClient
Procedure FilterProductGroupOnChange(Item)
	LoadProducts();
EndProcedure

&AtClient
Procedure VTOnActivateRow(Item)
	//CurData = items.VT.CurrentData;
	//If CurData <> Undefined Then 
	//	ShowPicture(CurData.Номенклатура);
	//EndIf;
EndProcedure

&AtServer
Procedure ShowPicture(Produit)
	НЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Produit);
	НЗ.Прочитать();
	Изображения.Загрузить(НЗ.Выгрузить());
	Изображения.Сортировать("ДатаДобавления убыв");
	Если Изображения.Количество()>0 Тогда 
		НомерКартинки = 1;
	КонецЕсли;
	ЗаполнитьИзображениеНаСервере(Produit);
EndProcedure

&НаСервере
Процедура ЗаполнитьИзображениеНаСервере(Produit)
	Если НомерКартинки > Изображения.Количество() Тогда
		НомерКартинки = Изображения.Количество();
	КонецЕсли;
	Если НомерКартинки = 0 Тогда
		FieldPhoto = "";
		УстановитьДоступностьКнопокКартинки();
		Возврат;
	КонецЕсли;
	ID = Изображения.Получить(НомерКартинки-1).ID;
	КлючЗаписиРег = РегистрыСведений.ПрисоединённыеФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,ID", Produit.Ссылка,ID));
	Если Не КлючЗаписиРег.Пустой() Тогда
		FieldPhoto = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные");
	КонецЕсли;
	УстановитьДоступностьКнопокКартинки();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКнопокКартинки()
	Если НомерКартинки = 0 Тогда 
		Элементы.ИзображениеВлево.Доступность = Ложь;
		Элементы.ИзображениеВправо.Доступность = Ложь;
	Иначе
		Элементы.ИзображениеВлево.Доступность = НомерКартинки > 1;
		Элементы.ИзображениеВправо.Доступность = НомерКартинки < Изображения.Количество();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеВправо(Команда)
	НомерКартинки = НомерКартинки + 1;
	CurData = items.VT.CurrentData;
	If CurData <> Undefined Then 
		ЗаполнитьИзображениеНаСервере(CurData.Номенклатура);
	EndIf;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеВлево(Команда)
	НомерКартинки = НомерКартинки - 1;
	CurData = items.VT.CurrentData;
	If CurData <> Undefined Then 
		ЗаполнитьИзображениеНаСервере(CurData.Номенклатура);
	EndIf;
КонецПроцедуры

// Устанавливает ограничения в динамическогм списке на отборы, сортировки и группировку на все поля списка
// для ускорения поиска по строке поиска и уменьшает количество ошибочных настроек пользователя
// убирает из ограничений поля указанные в отборах условного оформления, т.к. это ломает оформление
// Параметры:
//  Список           - ДинамическийСписок - Динамический список на который устанавливается отбор
//                 
//  РазрешенныеПоля  - Массив - состоящий из строк-имен полей по которым не устанавливаются ограничения
//
//
&НаСервере
Процедура УстановитьОграничениеДинамическогоСписка(Список, РазрешенныеПоля) Экспорт

	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
		Для Каждого ЭлементОтбора Из ЭлементНастроек.Отбор.Элементы Цикл
			РазрешенныеПоля.Добавить(Строка(ЭлементОтбора.ЛевоеЗначение));
		КонецЦикла;
	КонецЦикла;
	МассивПолей = Новый Массив;
	Для Каждого ЭлементСписка Из Список.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если РазрешенныеПоля.Найти(Строка(ЭлементСписка.Поле)) = Неопределено ИЛИ ЭлементСписка.Папка Тогда
			МассивПолей.Добавить(Строка(ЭлементСписка.Поле));
		КонецЕсли;
	КонецЦикла;
	
	Список.УстановитьОграниченияИспользованияВГруппировке(МассивПолей);
	Список.УстановитьОграниченияИспользованияВОтборе(МассивПолей);
	Список.УстановитьОграниченияИспользованияВПорядке(МассивПолей);
	
КонецПроцедуры // УстановитьОграничениеДинамическогоСписка()
